Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: To mirror the AWS Lambda environment as closely as possible in a dev environment, the Quarkus Amazon Lambda extension boots up a mock AWS Lambda event server in Quarkus Dev and Test mode. This mock event server simulates a true AWS Lambda environment.
ja_jp: 開発環境で AWS Lambda 環境を可能な限りミラーリングするために、Quarkus Amazon Lambda エクステンションは、Quarkus 開発およびテストモードで模擬 AWS Lambda イベントサーバーを起動します。この模擬イベントサーバーは、真の AWS Lambda 環境をシミュレートしています。

source: To model this process yourself, just follow these steps (start event should be automatically added)
ja_jp: このプロセスを自分でモデル化するには、以下の手順に従ってください(開始イベントが自動的に追加されます)。

source: To observe the health status change, you can observe the `io.smallrye.health.api.event.HealthStatusChangeEvent` with the standard CDI observation mechanism. Since we cannot guarantee that the observer method runs all the time on the worker thread (meaning it can run on the event loop thread), it's recommended that you never block in the in observer method.
ja_jp: ヘルスステータスの変化を監視するには、標準の CDI監視メカニズムで `io.smallrye.health.api.event.HealthStatusChangeEvent` を監視します。オブザーバメソッドがワーカースレッド上で常に実行されることは保証できませんので（つまり、イベントループスレッド上で実行される可能性があります）、オブザーバメソッド内で決してブロックしないことをお勧めします。

source: To obtain a configuration similar to the one above with the `packages` configuration property, create a `package-info.java` file with the following content:
ja_jp: 上記のような構成を `packages` の設定プロパティーで取得するには、以下の内容の `package-info.java` ファイルを作成します:

source: To obtain a managed instance, pass the original object to the STM `container` which then returns a reference through which you will be able to perform transactional operations. This reference can be used safely from multiple threads.
ja_jp: 管理されたインスタンスを取得するには、元のオブジェクトを STM `container` に渡します。すると、トランザクション的な操作を実行できるようになる参照を返します。この参照は、複数のスレッドから安全に使用することができます。

source: To optimize your application for Lambda SnapStart, check xref:amazon-snapstart.adoc[the SnapStart Configuration Documentation].
ja_jp: Lambda SnapStartにアプリケーションを最適化するためには、 link:amazon-snapstart.html[SnapStart 設定ドキュメント] を確認してください。

source: To optimize your application for Lambda SnapStart, check xref:aws-lambda-snapstart.adoc[the SnapStart Configuration Documentation].
ja_jp: アプリケーションをLambda SnapStartに最適化するには、 xref:aws-lambda-snapstart.adoc[SnapStart構成ドキュメント] を参照してください。

source: To orchestrate each consumer group's progress, each consumer periodically informs the broker of its current position - the last processed offset. It commits the offset, indicating that all the previous records from that partition have been processed. So, if a consumer stops and comes back later, it restarts from the last committed position (if assigned to that partition again). Note that this behavior is configurable.
ja_jp: 各コンシューマーグループの進捗を調整するために、各コンシューマーは定期的に現在の位置、つまり最後に処理されたオフセットをブローカに通知します。コンシューマは、そのパーティションの以前のレコードがすべて処理されたことを示すオフセットをコミットします。つまり、あるコンシューマーが停止して後で戻ってきた場合、最後にコミットされた位置から再スタートします(再びそのパーティションに割り当てられた場合)。この動作は設定可能であることに注意してください。

source: To pass the CDI Lite TCK, ArC also has a _strict_ mode. This mode enables additional validations and disables certain improvements that conflict with the specification.
ja_jp: CDI Lite TCK に合格させるために、ArC には _strict_ モードもあります。 このモードでは、追加の検証が有効になり、仕様と競合する特定の改善機能が無効になります。

source: To persist objects received from Kafka into a database, you can use Hibernate Reactive with Panache.
ja_jp: Kafka から受信したオブジェクトをデータベースに永続化するには、Hibernate Reactive with Panache を使用することができます。

source: To persist objects received from Kafka into a database, you can use Hibernate with Panache.
ja_jp: Kafka から受信したオブジェクトをデータベースに永続化するには、Hibernate with Panache を使用することができます。

source: To plug an OIDC client into it, use:
ja_jp: OIDC クライアントをプラグインするには、以下を使用します。

source: To preserve compatibility with Java 17 and 21, we currently use a backport of the Class-File API, but the Class-File API is relying on some classes from the underlying JDK. Several of these classes have seen significant optimizations in Java 25, and as a result, our bytecode generation performance improves noticeably when running on Java 25.
ja_jp: Java 17 と 21 との互換性を維持するため、現在は Class-File API のバックポートを使用していますが、Class-File API は基盤となる JDK の一部のクラスに依存しています。これらのクラスのいくつかは Java 25 で大幅な最適化が施されており、その結果、Java 25 で実行するとバイトコード生成のパフォーマンスが著しく向上します。

source: To prevent MITM attacks, when SSL is enabled, SSL host name validation is enabled by default in Infinispan. In this case, configuring the SNI host name is mandatory to start the client.
ja_jp: MITM攻撃を防ぐため、SSLが有効になっている場合、InfinispanではデフォルトでSSLホスト名検証が有効になっています。この場合、クライアントを起動するにはSNIホスト名の設定が必須です。

source: To prevent it from blocking, set `quarkus.smallrye-jwt.blocking-authentication=true`.
ja_jp: ブロックされないようにするには、 `quarkus.smallrye-jwt.blocking-authentication=true` を設定します。

source: To prevent it, set `quarkus.smallrye-jwt.blocking-authentication=true`.
ja_jp: これを防ぐには、 `quarkus.smallrye-jwt.blocking-authentication=true` を設定します。

source: To prevent re-authentication after the user is redirected to this page, ensure that this error endpoint is publicly accessible.
ja_jp: ユーザーがこのページにリダイレクトされて再認証されないようにするには、このエラーエンドポイントがパブリックにアクセス可能であることを確認します。

source: To prevent the cache from caching (marker) results from a remote call, we need to let the exception bubble out of the called method and catch it at the caller side:
ja_jp: リモートコールの結果をキャッシュ(マーカー)しないようにするには、コールされたメソッドから例外をバブルアップし、呼び出し側でキャッチする必要があります。

source: To prevent the user from being redirected to this page to be re-authenticated, ensure that this error endpoint is a public resource.
ja_jp: ユーザーがこのページにリダイレクトされて再認証されないようにするには、このエラーエンドポイントがパブリックリソースであるようにします。

source: To proceed with this section, the code project must be its <<starting-point>>. If you have changes related to the previous sections, please revert them or re-generate the project according to the <<starting-point>> instructions before proceeding.
ja_jp: このセクションを続行するには、コードプロジェクトが <<starting-point>> である必要があります。前のセクションに関連する変更がある場合は、それらを元に戻すか、<<starting-point>> の手順に従っ、プロジェクトを再生成してから進めてください。

source: To produce an OpenAPI Document which possibly *could* match the one produced during runtime, the `RUN` and `RUNTIME_STARTUP` RunStages are executed at build time - in a separate step from the `BUILD` RunStage. Any exception which occurs during this additional processing step is ignored, i.e. if one of the filters throws, none will have any effect.
ja_jp: 実行時に生成されるものと一致する可能性のある (*could*) OpenAPI ドキュメントを生成するために、 `RUN` および `RUNTIME_STARTUP` RunStage はビルド時に (`BUILD` RunStage とは別のステップで) 実行されます。この追加処理ステップ中に発生した例外は無視されます。つまり、いずれかのフィルターが例外をスローしても、それらは一切影響を及ぼしません。

source: To properly resolve Quarkus extension and other application dependencies Quarkus uses its own dependency resolver, which is implemented on top of the dependency resolver provided by the underlying build tool: Maven or Gradle.
ja_jp: Quarkus エクステンションやその他のアプリケーションの依存関係を適切に解決するために、Quarkus は独自の依存関係リゾルバーを使用します。この依存関係リゾルバーは、基盤となるビルドツール (Maven または Gradle) によって提供される依存関係リゾルバーの上に実装されています。

source: To protect your applications by using Bearer Token Authorization, see the xref:security-oidc-bearer-token-authentication.adoc[OpenID Connect (OIDC) Bearer token authentication] guide.
ja_jp: Bearer Token Authorization を使用してアプリケーションを保護するには、xref:security-oidc-bearer-token-authentication.adoc[OpenID Connect (OIDC) ベアラートークン認証] ガイドを参照してください。

source: To protect your database from overload during load peaks, set the pool size to throttle database load. The correct pool size depends on factors such as the number of concurrent users and the workload type.
ja_jp: 負荷ピーク時の過負荷からデータベースを保護するために、データベースの負荷を制限するようにプールサイズを設定します。 適切なプールサイズは、同時ユーザー数やワークロードの種類などの要因によって異なります。

source: To protect your database from overload during load peaks, size the pool appropriately to throttle the database load. The optimal pool size depends on many factors, such as the number of parallel application users or the nature of the workload.
ja_jp: 負荷ピーク時の過負荷からデータベースを保護するために、プールのサイズを適切に設定してデータベースの負荷を制限します。 最適なプールサイズは、並列アプリケーションのユーザー数やワークロードの性質など、多くの要因によって異なります。

source: To protect your database from overloading during load peaks, size the pool adequately to throttle the database load. The optimal pool size depends on many factors, such as the number of parallel application users or the nature of the workload.
ja_jp: 負荷のピーク時の過負荷からデータベースを保護するには、データベースの負荷を軽減するためにプールのサイズを適切に設定します。 最適なプールのサイズは、並列アプ リ ケーシ ョ ンのユーザー数や作業負荷の性質な ど、 さ ま ざ ま な要因に よ っ て異な り ます。

source: To protect your database from overloading during load peaks, size the pool adequately to throttle the database load. The proper size always depends on many factors, such as the number of parallel application users or the nature of the workload.
ja_jp: 負荷のピーク時の過負荷からデータベースを保護するには、データベースの負荷を軽減するためにプールのサイズを適切に設定します。 適切なサ イ ズは常に、 並列アプ リ ケーシ ョ ンのユーザー数や作業負荷の性質な ど、 さ ま ざ ま な要因に よ っ て異な り ます。

source: To protect your web applications, you can use the industry-standard OpenID Connect (OIDC) Authorization Code Flow mechanism provided by the Quarkus OIDC extension.
ja_jp: ウェブアプリケーションを保護するには、Quarkus OIDCエクステンションが提供する業界標準のOpenID Connect（OIDC）認可コードフローメカニズムを使用できます。

source: To provide a Dev Service, use the `DevServicesResultBuildItem` build item. See the xref:extension-writing-dev-service.adoc[Dev Services how-to] for more information.
ja_jp: 開発サービスを提供するには、 `DevServicesResultBuildItem` ビルドアイテムを使用します。詳細は、xref:extension-writing-dev-service.adoc[Dev Services のハウツー] を参照してください。

source: To provide a Spring-friendly experience while staying reactive, Quarkus allows you to inject the following types into your `@ExceptionHandler` methods:
ja_jp: リアクティブ性を保ちつつ Spring フレンドリーなエクスペリエンスを提供するため、Quarkus では、次の型を `@ExceptionHandler` メソッドにインジェクションできます。

source: To provide platform-specific defaults, the platform needs to include a dependency version constraint in its BOM for a properties artifact whose coordinates follow the following naming convention:
ja_jp: プ ラ ッ ト フ ォーム固有のデフ ォル ト を提供す る には、 プ ラ ッ ト フ ォームは、 座標が下記の命名規則に従っ てい る プ ロ パテ ィ アーテ ィ フ ァ ク ト に対 し て、 その BOM 内に依存バージ ョ ン制約を含める必要があ り ます。

source: To publish to these repositories, we recommend the usage of https://jreleaser.org/[JReleaser].
ja_jp: これらのリポジトリーに公開する際には、https://jreleaser.org/[JReleaser] の使用を推奨します。

source: To push a container image for your project, `quarkus.container-image.push=true` needs to be set using any of the ways that Quarkus supports.
ja_jp: プロジェクトにコンテナーイメージをプッシュするには、Quarkus がサポートしている方法のいずれかで、 `quarkus.container-image.push=true` を設定する必要があります。

source: To quickly create a hashed password, use `String BcryptUtil.bcryptHash(String password)`, which defaults to creating a random salt and hashing in ten iterations. This method also allows specifying the number of iterations and salt used.
ja_jp: ハッシュ化されたパスワードを素早く作成するには、 `String BcryptUtil.bcryptHash(String password)` を使ってください。デフォルトではランダムなソルトを作成し、10回繰り返してハッシュ化します。この方法では、繰り返しの回数と使用するソルトを指定することもできます。

source: To receive messages from RabbitMQ:
ja_jp: RabbitMQ からのメッセージを受信する場合。

source: To reduce the amount of log written by the Kafka client, Quarkus sets the level of the following log categories to `WARNING`:
ja_jp: Kafkaクライアントによって書き込まれるログの量を減らすために、Quarkusは以下のログカテゴリーのレベルを `WARNING` に設定しています。

source: To reduce the amount of times Quarkus needs to restart, `io.quarkus.test.junit.util.QuarkusTestProfileAwareClassOrderer` is registered as a global `ClassOrderer` as described in the link:https://docs.junit.org/current/user-guide/#writing-tests-test-execution-order-classes[JUnit User Guide]. The behavior of this `ClassOrderer` is configurable via `application.properties` using the property `quarkus.test.class-orderer`. The Quarkus orderer will attempt to sort according to the secondary orderer, with the constraint that tests which require the same application instance are grouped. The property accepts the FQCN of the `ClassOrderer` to use as a secondary orderer. It can be set to an orderer that is provided by JUnit or even your own custom one. If the class cannot be found, it fallbacks to JUnit default behaviour which does not set a `ClassOrderer` at all.
ja_jp: Quarkus の再起動回数を減らすために、 `io.quarkus.test.junit.util.QuarkusTestProfileAwareClassOrderer` は、 link:https://docs.junit.org/current/user-guide/#writing-tests-test-execution-order-classes[JUnit User Guide] に記載されているように、グローバル `ClassOrderer` として登録されます。この `ClassOrderer` の動作は、 `quarkus.test.class-orderer` プロパティーを使用して `application.properties` 経由で設定できます。Quarkus の ClassOrderer は、同じアプリケーションインスタンスを必要とするテストがグループ化されるという制約のもと、セカンダリーオーダーに従ってソートを試みます。このプロパティーは、セカンダリーオーダーとして使用する `ClassOrderer` の FQCN を受け入れます。JUnit が提供するオーダーや、独自のカスタムオーダーに設定できます。クラスが見つからない場合は、 `ClassOrderer` をまったく設定しない JUnit のデフォルトの動作にフォールバックします。

source: To reduce the amount of times Quarkus needs to restart, `io.quarkus.test.junit.util.QuarkusTestProfileAwareClassOrderer` is registered as a global `ClassOrderer` as described in the link:https://docs.junit.org/current/user-guide/#writing-tests-test-execution-order-classes[JUnit User Guide]. The behavior of this `ClassOrderer` is configurable via `application.properties` using the property `quarkus.test.class-orderer`. The property accepts the FQCN of the `ClassOrderer` to use. If the class cannot be found, it fallbacks to JUnit default behaviour which does not set a `ClassOrderer` at all. It can also be disabled entirely by setting another `ClassOrderer` that is provided by JUnit or even your own custom one.
ja_jp: Quarkus の再起動回数を減らすために、 link:https://docs.junit.org/current/user-guide/#writing-tests-test-execution-order-classes[JUnit ユーザーガイド] で説明されているように、 `io.quarkus.test.junit.util.QuarkusTestProfileAwareClassOrderer` がグローバルな `ClassOrderer` として登録されます。この `ClassOrderer` の動作は、設定プロパティー `quarkus.test.class-orderer` を使用して `application.properties` から設定可能です。このプロパティーには、使用する `ClassOrderer` の FQCN を指定します。クラスが見つからない場合は、 `ClassOrderer` を一切設定しない JUnit のデフォルトの動作にフォールバックします。また、JUnit が提供する別の `ClassOrderer` や独自のカスタム実装を設定することで、この機能を完全に無効にすることもできます。

source: To reduce the amount of times Quarkus needs to restart, `io.quarkus.test.junit.util.QuarkusTestProfileAwareClassOrderer` is registered as a global `ClassOrderer` as described in the link:https://junit.org/junit5/docs/current/user-guide/#writing-tests-test-execution-order-classes[JUnit 5 User Guide]. The behavior of this `ClassOrderer` is configurable via `application.properties` using the property `quarkus.test.class-orderer`. The property accepts the FQCN of the `ClassOrderer` to use. If the class cannot be found, it fallbacks to JUnit default behaviour which does not set a `ClassOrderer` at all. It can also be disabled entirely by setting another `ClassOrderer` that is provided by JUnit 5 or even your own custom one.
ja_jp: Quarkus の再起動回数を減らすために、 `io.quarkus.test.junit.util.QuarkusTestProfileAwareClassOrderer` は、link:https://junit.org/junit5/docs/current/user-guide/#writing-tests-test-execution-order-classes[JUnit 5 ユーザーガイド] に記載 されているように、グローバル `ClassOrderer` として登録されます。 この `ClassOrderer` の動作は、 `quarkus.test.class-orderer` プロパティーを使用して `application.properties` 経由で設定できます。 このプロパティーは、使用する `ClassOrderer` の FQCN を受け入れます。クラスが見つからない場合は、 JUnit のデフォルトの動作にフォールバックし、 `ClassOrderer` をまったく設定しません。また、JUnit 5 が提供する別の `ClassOrderer` や、独自のカスタム ClassOrderer を設定することで、完全に無効にすることもできます。

source: To reduce the amount of times Quarkus needs to restart, `io.quarkus.test.junit.util.QuarkusTestProfileAwareClassOrderer` is registered as a global `ClassOrderer` as described in the link:https://junit.org/junit5/docs/current/user-guide/#writing-tests-test-execution-order-classes[JUnit 5 User Guide]. The behavior of this `ClassOrderer` is configurable via `junit-platform.properties` (see the source code or javadoc for more details). It can also be disabled entirely by setting another `ClassOrderer` that is provided by JUnit 5 or even your own custom one. + Please note that as of JUnit 5.8.2 link:https://github.com/junit-team/junit5/issues/2794[only a single `junit-platform.properties` is picked up and a warning is logged if more than one is found]. If you encounter such warnings, you can get rid of them by removing the Quarkus-supplied `junit-platform.properties` from the classpath via an exclusion:
ja_jp: Quarkus の再起動回数を減らすために、link:https://junit.org/junit5/docs/current/user-guide/#writing-tests-test-execution-order-classes[JUnit 5 User Guide] にあるように `io.quarkus.test.junit.util.QuarkusTestProfileAwareClassOrderer` がグローバルな `ClassOrderer` として登録されています。この `ClassOrderer` の動作は `junit-platform.properties` で設定することができます (詳細はソースコードや javadoc を参照してください)。また、JUnit 5 が提供する別の `ClassOrderer` を設定することで、完全に無効にすることも可能です (独自のものを設定することも可能です)。さらに JUnit 5.8.2 の時点は、link:https://github.com/junit-team/junit5/issues/2794[単一の `junit-platform.properties` のみがピックアップされ、複数見つかった場合は警告が記録されることに注意してください。] このような警告が発生した場合は、Quarkus が提供する `junit-platform.properties` をクラスパスから除外することで、警告を取り除くことができます。

source: To reduce the amount of times Quarkus needs to restart, `io.quarkus.test.junit.util.QuarkusTestProfileAwareClassOrderer` is registered as a global `ClassOrderer` as described in the link:https://junit.org/junit5/docs/current/user-guide/#writing-tests-test-execution-order-classes[JUnit 5 User Guide]. The behavior of this orderer is configurable via `junit-platform.properties` (see the source code or javadoc for more details). It can also be disabled entirely by setting another orderer that is provided by JUnit 5 or even your own custom one. + Please note that as of JUnit 5.8.2 link:https://github.com/junit-team/junit5/issues/2794[only a single `junit-platform.properties` is picked up and a warning is logged if more than one is found]. If you encounter such warnings, you can can get rid of them by removing the Quarkus-supplied `junit-platform.properties` from the classpath via an exclusion:
ja_jp: Quarkus の再起動が必要な回数を減らすために、link:https://junit.org/junit5/docs/current/user-guide/#writing-tests-test-execution-order-classes[JUnit 5 ユーザーガイド] で説明されているように、 `io.quarkus.test.junit.util.QuarkusTestProfileAwareClassOrderer` がグローバル `ClassOrderer` として登録されています。この発注者の動作は、 `junit-platform.properties` を介して設定できます (詳細については、ソースコードまたは javadoc を参照してください)。また、JUnit 5 が提供する別の発注者や独自のカスタム発注者を設定することで、完全に無効にすることもできます。さらに、JUnit 5.8.2 の時点では、 link:https://github.com/junit-team/junit5/issues/2794[単一の `junit-platform.properties` のみ取得され、2 つ以上見つかった場合は警告がログに記録されることに注意してください] 。このような警告が発生した場合は、除外Quarkus が提供する `junit-platform.properties` を除外してからクラスパスから削除することで、警告を除去できます。

source: To refer to another file, use the xref macro with the full file name syntax and always specify the human-readable URL caption.
ja_jp: 別のファイルを参照するには、完全なファイル名構文でxrefマクロを使い、常に人間が読めるURLキャプションを指定してください。

source: To reference an example _named_ configuration that you created by using the `quarkus.tls.<name>.*` properties as explained in <<using-the-tls-registry>> , use the `tls-configuration-name` property as shown in the following examples:
ja_jp: <<using-the-tls-registry>> で説明されているとおり、 `quarkus.tls.<name>.*` プロパティーを使用して作成したサンプルの _名前付き_ 設定を参照するには、 次の例に示すように `tls-configuration-name` プロパティーを使用します。

source: To reference an example _named_ configuration that you created by using the `quarkus.tls.<name>.*` properties as explained in <<using-the-tls-registry>>, use the `tls-configuration-name` property as shown in the following examples:
ja_jp: <<using-the-tls-registry>> で説明されているように、`quarkus.tls.<name>.*` プロパティーを使用して作成したサンプルの _名前付き_ 設定を参照するには、次の例に示すように `tls-configuration-name` プロパティーを使用します。

source: To regain the symbols, we need to rebuild the binary instructing GraalVM not to delete the symbols. On top of that, enable DWARF debug info so that the stack traces can be populated with that information. From outside the tools container, execute:
ja_jp: シンボルを取り戻すには、シンボルを削除しないように GraalVM に指示するバイナリーを再ビルドする必要があります。さらに、DWARF デバッグ情報を有効にして、スタックトレースにその情報を入力できるようにします。ツールコンテナーの外部から、以下を実行します。

source: To register a certificate in the TLS registry by using the extension, the _processor_ extension must produce a `TlsCertificateBuildItem` composed of a name and a `CertificateSupplier`.
ja_jp: エクステンションを使用して TLS レジストリーに証明書を登録するには、_プロセッサー_ エクステンションで、名前と `CertificateSupplier` で構成される `TlsCertificateBuildItem` を生成する必要があります。

source: To register a class for reflection, one would need to create a Quarkus processor class and add a build step that registers reflection:
ja_jp: リフレクション用のクラスを登録するには、Quarkus プロセッサークラスを作成し、リフレクションを登録するビルドステップを追加する必要があります。

source: To register a logging filter:
ja_jp: ロギングフィルターの登録方法

source: To register custom SQL functions or types, in Hibernate ORM, you can implement the standard Hibernate interfaces:
ja_jp: Hibernate ORM でカスタム SQL 関数や型を登録するには、標準の Hibernate インターフェースを実装できます。

source: To register meters, you need a reference to a `MeterRegistry`, which is configured and maintained by the Micrometer extension. The `MeterRegistry` can be injected into your application as follows:
ja_jp: メーターを登録するには、Micrometerエクステンションによって設定され維持されている `MeterRegistry` への参照が必要です。 `MeterRegistry` は、次のようにしてアプリケーションに注入することができます。

source: To register meters, you need a reference to a `MeterRegistry`, which is configured and maintained by the Micrometer extension.
ja_jp: メーターを登録するには、Micrometer エクステンションによって設定および維持される `MeterRegistry` への参照が必要です。

source: To register meters, you need a reference to the `MeterRegistry` that is configured and maintained by the Micrometer extension.
ja_jp: メーターを登録するには、Micrometer エクステンションが設定および維持する `MeterRegistry` への参照が必要です。

source: To register your resource method listener, you need to provide a bean that implements the interface `RestDataResourceMethodListener`, for example:
ja_jp: リソースメソッドリスナーを登録するには、インターフェース `RestDataResourceMethodListener` を実装したBeanを提供する必要があります。例:

source: To remotely debug applications that are running on a kubernetes environment, we need to deploy the application as described in the previous section and add as new property: `quarkus.kubernetes.remote-debug.enabled=true`. This property will automatically configure the Java application to append the java agent configuration (for example: `-agentlib:jdwp=transport=dt_socket,server=y,suspend=n,address=5005`) and also the service resource to listen using the java agent port.
ja_jp: kubernetes 環境で動作しているアプリケーションをリモートでデバッグするには、前のセクションで説明したようにアプリケーションをデプロイし、新しいプロパティー (`quarkus.kubernetes.remote-debug.enabled=true`) として追加する必要があります。このプロパティーは、Java アプリケーションを自動的に設定し、Java エージェント設定 (例: `-agentlib:jdwp=transport=dt_socket,server=y,suspend=n,address=5005`) だけでなく、Java エージェントポートを使ってリッスンするサービスリソースも追加します。

source: To remove stale plugins or discover new plugins provided by extensions, the `quarkus plugin sync` command is available. With this command binaries and JBang aliases that are added to the catalog but are no longer available will be purged.
ja_jp: 古くなったプラグインの削除や、エクステンションによって提供される新しいプラグインの検出には、 `quarkus plugin sync` コマンドを使用できます。 このコマンドを使用すると、カタログに追加されたが使用できなくなったバイナリーと JBang エイリアスが削除されます。

source: To represent passwords stored in the database that were hashed by different algorithms, create a class that implements `org.wildfly.security.password.PasswordProvider` as shown in the following example.
ja_jp: 異なるアルゴリズムでハッシュ化されたデータベースに保存されたパスワードを表現するには、次の例に示すように `org.wildfly.security.password.PasswordProvider` を実装するクラスを作成します。

source: To represent passwords stored in the database which were hashed using different hashing algorithms, create a class that implements `org.wildfly.security.password.PasswordProvider` as shown in the example below.
ja_jp: 異なるハッシュ・アルゴリズムを使ってハッシュ化されたデータベースに保存されたパスワードを表現するには、以下の例に示すように、 `org.wildfly.security.password.PasswordProvider` を実装するクラスを作成します。

source: To resolve the tenant from incoming requests and map it to a specific `quarkus-oidc` tenant configuration in `application.properties`, create an implementation for the `io.quarkus.oidc.TenantConfigResolver` interface, which can dynamically resolve tenant configurations:
ja_jp: 受信リクエストからテナントを解決し、`application.properties` 内の特定の `quarkus-oidc` テナント設定にマップするには、テナント設定を動的に解決できる `io.quarkus.oidc.TenantConfigResolver` インターフェイスの実装を作成します。
